import streamlit as st
import pandas as pd
import numpy as np
df = pd.DataFrame(
   [
      ["新实惠牛肉牛杂火锅(普罗旺斯店)",22.771317,108.282949],
      ["海底捞火锅(百盛步行街店)", 22.814160,108.321510],
      ["桂小邕·南宁鲜货烧烤(鲁班店)", 22.836859,108.284352],
      ["懒人星贫穷烧烤", 22.787842,108.307385],
      ["茶炮·重庆老火锅(农院路店)", 22.834087,108.295123]
   ],
    columns=["店名", "latitude", "longitude"])
df.index.name="序号"
st.subheader("👀各家店所在:red[位置]")
st.map(df)

data = {
    '月份':['01月', '02月', '03月', '04月', '05月', '06月'],
    '新实惠牛肉牛杂火锅(普罗旺斯店)':[4.7, 4.8, 4.7, 4.9, 4.8, 4.9],
    '海底捞火锅(百盛步行街店)':[4.5, 4.4, 4.6, 4.7, 4.6, 4.8],
    '桂小邕·南宁鲜货烧烤(鲁班店)':[4.3, 4.2, 4.4, 4.5, 4.6, 4.7],
    '懒人星贫穷烧烤':[4.6, 4.7, 4.5, 4.6, 4.4, 4.5],
    '"茶炮·重庆老火锅(农院路店)':[4.8, 4.8, 4.9, 4.9, 4.8, 4.9],
}
df = pd.DataFrame(data)
st.subheader("⭐各门店月度:red[评分]")
df_chart = df.set_index("月份")
st.bar_chart(df_chart)


data = {
'店名': ['新实惠牛肉牛杂火锅(普罗旺斯店)', '海底捞火锅(百盛步行街店)', '桂小邕·南宁鲜货烧烤(鲁班店)', '懒人星贫穷烧烤', '"茶炮·重庆老火锅(农院路店)'],
'人均价格(元)': [88,66,78,70,60], 
}
df = pd.DataFrame(data)
st.subheader("💸各家店的:red[人均价格]")
df_chart = df.set_index("店名")
st.line_chart(df_chart)
data = {
    '时段':['11:30-13:30', '14:00-16:00', '17:30-19:30', '19:00-23:00'], 
    '新实惠牛肉牛杂火锅(普罗旺斯店)':[5, 2, 4, 3],
    '海底捞火锅(百盛步行街店)':[2, 1, 3, 5],
    '桂小邕·南宁鲜货烧烤(鲁班店)':[2, 4, 3, 4],
    '懒人星贫穷烧烤':[3, 1, 5, 4],
    '茶炮·重庆老火锅(农院路店)':[5, 2, 4, 3],
}
df = pd.DataFrame(data)
st.subheader("⏰各家店:red[用餐高峰时段]")
st.area_chart(df, x='时段')
df.set_index('时段', inplace=True)

st.subheader("***各门店12个月的:red[价格走势]***")
data1 = {
                '新实惠牛肉牛杂火锅(普罗旺斯店)':[42, 36, 56, 39, 45, 56, 45, 56, 46, 48, 38, 48],
                                                                                            '海底捞火锅(百盛步行街店)':[28, 25, 32, 28, 39, 42, 29, 36, 28, 48, 42, 36],
                                                                                             '桂小邕·南宁鲜货烧烤(鲁班店)':[15, 19, 26, 32, 36, 28, 45, 36, 42, 25, 35, 32],
                                                                                            '懒人星贫穷烧烤':[25, 30, 28, 29, 35, 36, 32, 27, 36, 28, 37, 31],
                                                                                            '茶炮·重庆老火锅(农院路店)':[40, 45, 35, 36, 41, 28, 26, 37, 25, 32, 28, 37],
                }
index = pd.Series(['01月', '02月', '03月', '04月', '05月', '06月', '07月', '08月', '09月', '10月', '11月', '12月'])
df1 = pd.DataFrame(data1, index=index)
st.line_chart(df1)
